type ImageAuthor = "SY" | "border" | "noborder" | "jv" | "SY pua2 man1" | "jv touch panel" | "meloviliju" | "liina baani bhodi" | "grau prua yr" | "geometric" | "tamoto mincho" | "herm giaru" | "rounded" | "SY-FengNegi";

type ElementOf<A extends any[]> = A extends (infer Elm)[] ? Elm : unknown;
type IsNever<T> = T[] extends never[] ? true : false;

function allElements<V>(): <Arr extends V[]>(arr: Arr) =>
	IsNever<Exclude<V, ElementOf<Arr>>> extends true ? V[] : unknown {
	return arr => arr as any;
}

// ここでの順序が表にしたときの列順も定める
const imageAuthors: ImageAuthor[] = allElements<ImageAuthor>()(["SY", "SY-FengNegi", "border", "noborder", "jv", "SY pua2 man1", "jv touch panel", "meloviliju", "geometric", "tamoto mincho", "rounded", "herm giaru", "liina baani bhodi", "grau prua yr"]);

type FolderName = keyof FolderType;
interface FolderType {
	"燐字画像": ImageAuthor,
	"燐字画像2": ImageAuthor,
	"燐字画像3": ImageAuthor,
	"燐字画像4": ImageAuthor,
	"燐字画像5": ImageAuthor,
	"燐字画像6": ImageAuthor,
	"燐字画像7": ImageAuthor,
	"燐字画像8": ImageAuthor,
	"燐字画像9": ImageAuthor,
	"燐字画像10": ImageAuthor,
	"燐字画像11": ImageAuthor,
	"燐字画像12": ImageAuthor,
	"燐字画像13": ImageAuthor,
	"燐字画像14": ImageAuthor,
	"燐字画像15": ImageAuthor,
	"燐字画像16": ImageAuthor,
	"燐字画像17": ImageAuthor,
	"燐字画像18": ImageAuthor,
	"燐字画像19": ImageAuthor,
	"燐字画像20": ImageAuthor,
	"燐字画像21": ImageAuthor,
	"燐字画像22": ImageAuthor,
	"燐字画像23": ImageAuthor,
	"燐字画像24": ImageAuthor,
	"燐字画像25": ImageAuthor,
	"燐字画像26": ImageAuthor,
	"燐字画像27": ImageAuthor,
	"燐字画像28": ImageAuthor,
	"燐字画像29": ImageAuthor,
	"燐字画像30": ImageAuthor,
	"刀風官": ImageAuthor,
	"幾何刀字": ImageAuthor,
	"燐字画像31": ImageAuthor,
	"燐字画像32": ImageAuthor,
	"燐字画像33": ImageAuthor,
	"燐字画像34": ImageAuthor,
	"燐字画像35": ImageAuthor,
	"燐字画像36": ImageAuthor,
	"燐字画像37": ImageAuthor,
	"燐字画像38": ImageAuthor,
	"燐字画像39": ImageAuthor,
	"燐字画像40": ImageAuthor,
	"燐字画像41": ImageAuthor,
	"燐字画像42": ImageAuthor,
	"燐字画像43": ImageAuthor,
	"燐字画像44": ImageAuthor,
	"燐字画像45": ImageAuthor,
	"燐字画像46": ImageAuthor,
	"燐字画像47": ImageAuthor,
	"燐字画像48": ImageAuthor,
	"燐字画像49": ImageAuthor,
	"燐字画像50": ImageAuthor,
	"燐字画像51": ImageAuthor,
	"燐字画像52": ImageAuthor,
	"燐字画像53": ImageAuthor,
	"たもと明朝": ImageAuthor,
	"美門倉官字": ImageAuthor,
	"燐字画像54": ImageAuthor,
	"燐字画像55": ImageAuthor,
	"燐字画像56": ImageAuthor,
	"燐字画像57": ImageAuthor,
	"燐字画像58": ImageAuthor,
	"燐字画像59": ImageAuthor,
	"骨軸倉字": ImageAuthor,
	"風行雪笛": ImageAuthor,
}

type Linzi = "我" | "汝" | "此" | "其" | "彼" | "何" | "或" | "全" | "無" | "在" | "互" | "己" | "物" | "人" | "如" | "之" | "処" | "時" | "故" | "位" | "術" | "言" | "字" | "筆" | "書" | "墨" | "文" | "論" | "紙" | "絵" | "手" | "足" | "心" | "目" | "口" | "骨" | "頭" | "腹" | "背" | "肉" | "光" | "闇" | "木" | "草" | "火" | "水" | "風" | "石" | "金" | "膠" | "花" | "種" | "果" | "油" | "脂" | "大" | "中" | "小" | "周" | "内" | "外" | "軸" | "衣" | "糸" | "日" | "月" | "星" | "天" | "地" | "山" | "谷" | "川" | "海" | "陸" | "島" | "上" | "下" | "左" | "右" | "東" | "西" | "南" | "北" | "縦" | "横" | "高" | "低" | "始" | "終" | "生" | "入" | "一" | "二" | "三" | "四" | "五" | "六" | "七" | "八" | "九" | "撃" | "行" | "来" | "識" | "獣" | "鳥" | "魚" | "虫" | "龍" | "機" | "箱" | "男" | "女" | "皇" | "神" | "船" | "兵" | "弓" | "車" | "虎" | "馬" | "巫" | "将" | "王" | "類" | "為" | "貝" | "刀" | "声" | "家" | "善" | "友" | "美" | "受" | "与" | "力" | "須" | "而" | "即" | "御" | "再" | "乎" | "於" | "遠" | "悪" | "真" | "噫" | "雪" | "夏" | "冬" | "止" | "激" | "付" | "端" | "律" | "集" | "亦" | "値" | "積" | "国" | "同" | "閉" | "開" | "春" | "秋" | "子" | "混" | "倉" | "官" | "民" | "迷" | "意" | "連" | "常" | "祭" | "笑" | "戦" | "壊" | "等" | "形" | "毎" | "静" | "層" | "極" | "色" | "季" | "銭" | "名" | "労" | "助" | "冠" | "満" | "族" | "清" | "定" | "錘" | "赤" | "菓" | "硬" | "牌" | "軟" | "豊" | "貧" | "倒" | "長" | "傾" | "圧" | "鼓" | "包" | "机" | "散" | "席" | "深" | "門" | "認" | "傷" | "棚" | "寝" | "綿" | "普" | "少" | "輩" | "黒" | "反" | "磨" | "輪" | "血" | "帯" | "覆" | "謝" | "豆" | "父" | "琴" | "白" | "煙" | "寒" | "古" | "耳" | "抗" | "母" | "軽" | "米" | "勿" | "猫" | "酒" | "学" | "守" | "十" | "囲" | "道" | "奮" | "急" | "素" | "新" | "蜜" | "祖" | "前" | "使" | "体" | "唯" | "従" | "茶" | "正" | "樽" | "遊" | "味" | "甘" | "型" | "歌" | "謎" | "裁" | "怖" | "質" | "党" | "片" | "件" | "震" | "加" | "別" | "青" | "嗅" | "後" | "歪" | "近" | "広" | "万" | "挽" | "平" | "百" | "欽" | "夘" | "布" | "械" | "函" | "輝" | "累" | "禦" | "立" | "疲" | "辿" | "千" | "座" | "旦" | "通" | "強" | "哩" | "麗" | "塩" | "耒" | "貓" | "能" | "咍" | "柔" | "恒" | "犬" | "胸" | "聯" | "頬" | "穏" | "短" | "直" | "棉" | "箏" | "孰" | "毛" | "那" | "茲" | "詞" | "店" | "巻" | "躍" | "壁" | "㕮" | "吁" | "遅" | "牛" | "鎖" | "多" | "卵" | "球" | "網" | "羊" | "救" | "皷" | "从" /*| "后"*/ | "穴" | "凹" | "笛" | "筒" | "増" | "笙" | "淮" | "竹" | "竺" | "属" | "針" | "翰" | "寐" | "享" | "失" | "軍" | "隊" | "思" | "橋" | "帝" | "半" | "氏" | "閥" | "纂" | "穐" | "啌" | "哇" | "浬" | "埴" | "刻" | "硫" | "俐" | "羅" | "聚" | "叛" | "科" | "吏" | "宦" | "僚" | "健" | "兄" | "佰" | "顫"
	| "振"
	| "帽"
	| "瑪" | "産" | "呉" | "刺" | "育" | "呻" | "待" | "試" | "杯" | "叮" | "可" | "檸" | "蛋" | "顔" | "醇" | "羚" | "牡" | "槍" | "鑓" | "斧" | "必" | "囁" | "叫" | "鶏"
	| "洛"
	| "趙"
	| "倶"
	| "億" | "決" | "引" | "訴" | "汪" | "哦" | "嘗"
	| "榎" | "株"
	| "織" | "村"
	| "犛" | "牲" | "溜" | "泉" | "玉" | "叉" | "飛" | "鍋" | "蟲" | "矢" | "玄" | "慥" | "釘" | "槌" | "妙" | "癒"
	| "涙" | "悖" | "順" | "嗚" | "黍" | "土" | "乾" | "湿"
	| "搾" | "窄" | "斥"
	| "逆" | "鹽" | "鹵" | "苦" | "渋" | "辣" | "節" | "田" | "旱" | "氾" | "腰" | "像" | "踵" | "匁" | "飢" | "支" | "奉" | "捧" | "贄" | "鍬" | "謗" | "佞" | "麺" | "餅"
	| "招" | "賢" | "緑" | "虹" | "雷" | "靴" | "麦" | "棆" | "眉" | "残" | "豚" | "豕" | "泪"; // REQUIRES CONSTANT UPDATE

const linzi_list: ReadonlyArray<Linzi> = allElements<Linzi>()(["我", "汝", "此", "其", "彼", "何", "或", "全", "無", "在", "互", "己", "物", "人", "如", "之", "処", "時", "故", "位", "術", "言", "字", "筆", "書", "墨", "文", "論", "紙", "絵", "手", "足", "心", "目", "口", "骨", "頭", "腹", "背", "肉", "光", "闇", "木", "草", "火", "水", "風", "石", "金", "膠", "花", "種", "果", "油", "脂", "大", "中", "小", "周", "内", "外", "軸", "衣", "糸", "日", "月", "星", "天", "地", "山", "谷", "川", "海", "陸", "島", "上", "下", "左", "右", "東", "西", "南", "北", "縦", "横", "高", "低", "始", "終", "生", "入", "一", "二", "三", "四", "五", "六", "七", "八", "九", "撃", "行", "来", "識", "獣", "鳥", "魚", "虫", "龍", "機", "箱", "男", "女", "皇", "神", "船", "兵", "弓", "車", "虎", "馬", "巫", "将", "王", "類", "為", "貝", "刀", "声", "家", "善", "友", "美", "受", "与", "力", "須", "而", "即", "御", "再", "乎", "於", "遠", "悪", "真", "噫", "雪", "夏", "冬", "止", "激", "付", "端", "律", "集", "亦", "値", "積", "国", "同", "閉", "開", "春", "秋", "子", "混", "倉", "官", "民", "迷", "意", "連", "常", "祭", "笑", "戦", "壊", "等", "形", "毎", "静", "層", "極", "色", "季", "銭", "名", "労", "助", "冠", "満", "族", "清", "定", "錘", "赤", "菓", "硬", "牌", "軟", "豊", "貧", "倒", "長", "傾", "圧", "鼓", "包", "机", "散", "席", "深", "門", "認", "傷", "棚", "寝", "綿", "普", "少", "輩", "黒", "反", "磨", "輪", "血", "帯", "覆", "謝", "豆", "父", "琴", "白", "煙", "寒", "古", "耳", "抗", "母", "軽", "米", "勿", "猫", "酒", "学", "守", "十", "囲", "道", "奮", "急", "素", "新", "蜜", "祖", "前", "使", "体", "唯", "従", "茶", "正", "樽", "遊", "味", "甘", "型", "歌", "謎", "裁", "怖", "質", "党", "片", "件", "震", "加", "別", "青", "嗅", "後", "歪", "近", "広", "万", "挽", "平", "百", "欽", "夘", "布", "械", "函", "輝", "累", "禦", "立", "疲", "辿", "千", "座", "旦", "通", "強", "哩", "麗", "塩", "耒", "貓", "能", "咍", "柔", "恒", "犬", "胸", "聯", "頬", "穏", "短", "直", "棉", "箏", "孰", "毛", "那", "茲", "詞", "店", "巻", "躍", "壁", "㕮", "吁", "遅", "牛", "鎖", "多", "卵", "球", "網", "羊", "救", "皷", "从", "穴", "凹", "笛", "筒", "増", "笙", "淮", "竹", "竺", "属", "針", "翰", "寐", "享", "失", "軍", "隊", "思", "橋", "帝", "半", "氏", "閥", "纂", "穐", "啌", "哇", "浬", "埴", "刻", "硫", "俐", "羅", "聚", "叛", "科", "吏", "宦", "僚", "健", "兄", "佰", "顫",
	"振",
	"帽",
	"瑪", "産", "呉", "刺", "育", "呻", "待", "試", "杯", "叮", "可", "檸", "蛋", "顔", "醇", "羚", "牡", "槍", "鑓", "斧", "必", "囁", "叫", "鶏", "洛",
	"趙",
	"倶",
	"億", "決", "引", "訴", "汪", "哦", "嘗",
	"榎", "株",
	"織", "村",
	"犛", "牲", "溜", "泉", "玉", "叉", "飛", "鍋", "蟲", "矢",
	"玄", "慥", "釘", "槌", "妙", "癒",
	"涙", "悖", "順", "嗚", "黍", "土", "乾", "湿",
	"搾", "窄", "斥",
	"逆", "鹽", "鹵", "苦", "渋", "辣", "節", "田", "旱", "氾", "腰", "像", "踵", "匁", "飢", "支", "奉", "捧", "贄", "鍬", "謗", "佞", "麺", "餅",
	"招", "賢", "緑", "虹", "雷", "靴", "麦", "棆", "眉", "残", "豚", "豕", "泪"
]); // REQUIRES CONSTANT UPDATE

const defined_but_no_image_prepared: ReadonlyArray<Linzi> = [];
const folder_names: ReadonlyArray<FolderName> = allElements<FolderName>()(["燐字画像", "燐字画像2", "燐字画像3", "燐字画像4", "燐字画像5", "燐字画像6", "燐字画像7", "燐字画像8", "燐字画像9", "燐字画像10", "燐字画像11", "燐字画像12", "燐字画像13", "燐字画像14", "燐字画像15", "燐字画像16", "燐字画像17", "燐字画像18", "燐字画像19", "燐字画像20", "燐字画像21", "燐字画像22", "燐字画像23", "燐字画像24", "燐字画像25", "燐字画像26", "燐字画像27", "燐字画像28", "燐字画像29", "燐字画像30", "刀風官", "幾何刀字", "燐字画像31", "燐字画像32", "燐字画像33", "燐字画像34", "燐字画像35", "燐字画像36", "燐字画像37", "燐字画像38", "燐字画像39", "燐字画像40", "燐字画像41", "燐字画像42", "燐字画像43", "燐字画像44", "燐字画像45", "燐字画像46", "燐字画像47", "燐字画像48", "たもと明朝", "美門倉官字", "燐字画像49", "燐字画像50", "燐字画像51", "燐字画像52", "燐字画像53", "燐字画像54", "燐字画像55", "燐字画像56", "燐字画像57", "燐字画像58", "燐字画像59", "骨軸倉字", "風行雪笛"]);
const folder_type: FolderType = {
	"燐字画像": "SY",
	"燐字画像2": "border",
	"燐字画像3": "noborder",
	"燐字画像4": "jv",
	"燐字画像5": "jv",
	"燐字画像6": "SY",
	"燐字画像7": "SY",
	"燐字画像8": "jv",
	"燐字画像9": "jv",
	"燐字画像10": "jv",
	"燐字画像11": "SY pua2 man1",
	"燐字画像12": "SY",
	"燐字画像13": "jv",
	"燐字画像14": "border",
	"燐字画像15": "noborder",
	"燐字画像16": "jv",
	"燐字画像17": "jv touch panel",
	"燐字画像18": "border",
	"燐字画像19": "noborder",
	"燐字画像20": "border",
	"燐字画像21": "noborder",
	"燐字画像22": "meloviliju",
	"燐字画像23": "border",
	"燐字画像24": "noborder",
	"燐字画像25": "SY",
	"燐字画像26": "jv",
	"燐字画像27": "jv touch panel",
	"燐字画像28": "border",
	"燐字画像29": "noborder",
	"燐字画像30": "liina baani bhodi",
	"刀風官": "grau prua yr",
	"幾何刀字": "geometric",
	"燐字画像31": "meloviliju",
	"燐字画像32": "meloviliju",
	"燐字画像33": "border",
	"燐字画像34": "noborder",
	"燐字画像35": "SY",
	"燐字画像36": "border",
	"燐字画像37": "noborder",
	"燐字画像38": "jv",
	"燐字画像39": "SY pua2 man1",
	"燐字画像40": "jv touch panel",
	"燐字画像41": "meloviliju",
	"燐字画像42": "jv",
	"燐字画像43": "jv touch panel",
	"燐字画像44": "border",
	"燐字画像45": "noborder",
	"燐字画像46": "border",
	"燐字画像47": "noborder",
	"燐字画像48": "SY",
	"燐字画像49": "border",
	"燐字画像50": "noborder",
	"燐字画像51": "SY",
	"燐字画像52": "border",
	"燐字画像53": "noborder",
	"たもと明朝": "tamoto mincho",
	"美門倉官字": "herm giaru",
	"燐字画像54": "border",
	"燐字画像55": "noborder",
	"燐字画像56": "border",
	"燐字画像57": "noborder",
	"燐字画像58": "jv",
	"燐字画像59": "meloviliju",
	"骨軸倉字": "rounded",
	"風行雪笛": "SY-FengNegi",
};
