type LinziSet = Set<Linzi>;
const all_linzi: LinziSet = new Set(linzi_list);
const o = (() => {
    // Criteria 1: The character's glyph should be already defined
    const glyph_is_defined: LinziSet = (new Set(linzi_list)).difference(new Set(linzi_glyph_not_defined));
    const spoonfed_pekzep_20241231: LinziSet = new Set(["我", "彼", "之", "此", "於", "在", "行", "言", "汝", "心", "無", "処", "何", "極", "善", "終", "学", "等", "銭", "人", "識", "乎", "時", "与", "来", "家", "一", "書", "日", "国", "下", "手", "労", "口", "力", "目", "而", "水", "多", "生", "上", "須", "噫", "使", "子", "友", "為", "星", "筆", "風", "如", "哩", "牌", "天", "機", "道", "木", "大", "加", "火", "茶", "男", "周", "冠", "再", "其", "全", "別", "絵", "二", "門", "車", "集", "小", "入", "故", "女", "衣", "術", "甘", "果", "勿", "互", "足", "件", "闇", "硬", "真", "清", "輩", "字", "耳", "寝", "同", "受", "即", "神", "父", "地", "種", "犬", "律", "声", "長", "淮", "川", "刀", "遊", "物", "激", "戦", "夏", "助", "倉", "雪", "杯", "少", "始", "付", "訴", "片", "母", "机", "急", "奮", "囲", "十", "魚", "酒", "壊", "享", "鳥", "草", "花", "石", "悪", "蜜", "美", "箱", "値", "軟", "色", "怖", "席", "豊", "混", "春", "新", "失", "体", "三", "開", "貧", "琴", "将", "定", "龍", "軸", "笛", "立", "百", "白", "獣", "月", "己", "四", "唯", "古", "高", "錘", "謎", "裁", "紙", "皇", "猫", "満", "止", "挽", "意", "待", "常", "壁", "名", "反", "傷", "位", "船", "米", "毎", "散", "撃", "官", "守", "塩", "光", "倒", "亦", "馬", "震", "閉", "論", "端", "直", "族", "或", "引", "島", "圧", "叮", "包", "兵", "黒", "類", "静", "赤", "虫", "牛", "毛", "平", "層", "寒", "墨", "金", "遠", "煙", "歌", "季", "嗅", "哇", "味", "右", "卵", "万", "㕮", "骨", "青", "連", "軽", "謝", "試", "西", "羊", "穴", "積", "王", "橋", "棚", "従", "左", "叫", "凹", "冬", "六", "迷", "躍", "認", "虎", "肉", "網", "筒", "笑", "秋", "祭", "癒", "油", "汪", "檸", "東", "普", "御", "後", "弓", "広", "山", "哦", "咍", "南", "前", "八", "傾", "五", "七", "鼓", "顔", "針", "釘", "輪", "貝", "豆", "覆", "血", "膠", "翰", "羅", "綿", "糸", "祖", "硫", "短", "球", "民", "歪", "正", "樽", "斥", "文", "形", "北", "俐", "九"]);

    const additionally_endorsed_by_SY: LinziSet = new Set(["抗", "巫", "遅", "妙", "型", "巻", "質"]) /* https://discord.com/channels/440134857398550558/1323353270789603418/1324814736642019391 */;

    // Criteria 2: The character should be endorsed by spoonfed_pekzep_20241231, or additionally endorsed by SY
    const modified_spoonfed: LinziSet = spoonfed_pekzep_20241231.union(additionally_endorsed_by_SY).difference(new Set(["訴", "謎", "試"]));

    // Criteria 3: The character's glyph should be implemented in the linzklar_rounded font
    const linzklar_rounded: LinziSet = new Set(ROUNDED_EXISTENCE_TABLE);

    // Criteria 4: The character's pekzep sound should be already declared
    const pekzep_sound_defined: LinziSet = new Set(["我", "汝", "此", "其", "彼", "何", "或", "全", "無", "在", "互", "己", "物", "人", "如", "之", "処", "時", "故", "位", "術", "言", "字", "筆", "書", "墨", "文", "論", "紙", "絵", "手", "足", "心", "目", "口", "骨", "肉", "光", "闇", "木", "草", "火", "水", "風", "石", "金", "膠", "花", "種", "果", "油", "大", "中", "小", "周", "軸", "衣", "糸", "日", "月", "星", "天", "地", "山", "川", "島", "上", "下", "左", "右", "東", "西", "南", "北", "高", "始", "終", "生", "入", "一", "二", "三", "四", "五", "六", "七", "八", "九", "撃", "行", "来", "識", "獣", "鳥", "魚", "虫", "龍", "機", "箱", "男", "女", "皇", "神", "船", "兵", "弓", "車", "虎", "馬", "巫", "将", "王", "類", "為", "貝", "刀", "声", "家", "善", "友", "美", "受", "与", "力", "須", "而", "即", "御", "再", "乎", "於", "遠", "悪", "真", "噫", "雪", "夏", "冬", "止", "激", "付", "端", "律", "集", "亦", "値", "積", "国", "同", "閉", "開", "春", "秋", "子", "混", "倉", "官", "民", "迷", "意", "連", "常", "祭", "笑", "戦", "壊", "等", "形", "毎", "静", "層", "極", "色", "季", "銭", "名", "労", "助", "冠", "満", "族", "清", "定", "錘", "赤", "菓", "硬", "牌", "軟", "豊", "貧", "倒", "長", "傾", "圧", "鼓", "包", "机", "散", "席", "深", "門", "認", "傷", "棚", "寝", "綿", "普", "少", "輩", "黒", "反", "磨", "輪", "血", "帯", "覆", "謝", "豆", "父", "琴", "白", "煙", "寒", "古", "耳", "抗", "母", "軽", "米", "勿", "猫", "酒", "学", "守", "十", "囲", "道", "奮", "急", "素", "新", "蜜", "祖", "前", "使", "体", "唯", "従", "茶", "正", "樽", "遊", "味", "甘", "型", "歌", "謎", "裁", "怖", "質", "党", "片", "件", "震", "加", "別", "青", "嗅", "後", "歪", "近", "広", "万", "挽", "平", "百", "欽", "布", "械", "函", "輝", "累", "禦", "立", "哩", "麗", "塩", "耒", "貓", "咍", "柔", "犬", "胸", "短", "直", "棉", "箏", "毛", "巻", "躍", "壁", "㕮", "吁", "遅", "牛", "多", "卵", "球", "網", "羊", "救", "皷", "从", "穴", "凹", "笛", "筒", "淮", "属", "針", "翰", "寐", "享", "失", "隊", "橋", "氏", "纂", "穐", "啌", "哇", "浬", "刻", "羅", "聚", "叛", "佰", "顫", "振", "帽", "瑪", "産", "呉", "待", "試", "杯", "叮", "檸", "蛋", "顔", "醇", "必", "叫", "決", "引", "訴", "汪", "哦", "嘗", "榎", "玄", "釘", "妙", "癒", "順", "嗚", "斥", "鹽", "招", "橘"]);

    return { glyph_is_defined, modified_spoonfed, linzklar_rounded, pekzep_sound_defined };
})();

for (const linzi of all_linzi) {
    const { glyph_is_defined, modified_spoonfed, linzklar_rounded, pekzep_sound_defined } = o;
    const is_in_glyph_is_defined = glyph_is_defined.has(linzi);
    const is_in_modified_spoonfed = modified_spoonfed.has(linzi);
    const is_in_linzklar_rounded = linzklar_rounded.has(linzi);
    const is_in_pekzep_sound_defined = pekzep_sound_defined.has(linzi);

    // to bitset
    const b = (x: boolean) => x ? 1 : 0;

    const bitset = b(is_in_glyph_is_defined) << 3 | b(is_in_modified_spoonfed) << 2 | b(is_in_linzklar_rounded) << 1 | b(is_in_pekzep_sound_defined);
    console.log(`${linzi}\t${bitset}`);
}