from matplotlib.image import imread
import matplotlib.pyplot as plt
import numpy as np
linziList1 = [
    "蛋","凹", "毛", "挽", "茶", "豆", "助", "遠",
    "顔","淮", "巻", "立", "正", "白", "定", "雪",
    "醇","思", "躍", "疲", "樽", "煙", "軟", "夏",
    "羚","帝", "壁", "座", "遊", "寒", "貧", "激",
    "牡","氏", "㕮", "通", "甘", "耳", "長", "付",
    "槍","閥", "吁", "能", "型", "抗", "傾", "端",
    "鑓","纂", "牛", "咍", "裁", "軽", "鼓", "子",
    "斧","穐", "卵", "犬", "怖", "酒", "散", "混",
    "必","啌", "球", "胸", "質", "道", "深", "民",
    "囁","哇", "羊", "聯", "片", "奮", "傷", "迷",
    "叫","刺", "救", "穏", "件", "急", "棚", "常",
    "鶏","育", "皷", "短", "震", "素", "普", "祭",
    "","呻", "从", "直", "嗅", "祖", "少", "形",
    "","杯", "后", "棉", "歪", "前", "反", "毎",
    "","可", "穴", "箏", "広", "従", "血", "労"
	       ]
t1 = [[3.49750000e+02,  3.73785714e+02, - 1.78571429e-01],
      [4.74000000e+02,  5.71428571e-01,  2.75571429e+02]]


def main():
	foo('img1.png',linziList1,t1)

def foo(path,list_,t):
	A = imread(path)
	for i in range(len(list_)):
		save(t,A,int(i/8),i%8,list_[i]);


# ith row, jth column
def save(t,A,i,j,name):
	if name == "":
		return
	I = int(t[0][0] + t[0][1]*j + t[0][2]*i)
	J = int(t[1][0] + t[1][1]*j + t[1][2]*i)
	B = A[J:J+279,I:I+279]
	plt.imsave('../燐字画像26/'+name + '.png', B)
	print(name)

if __name__ == '__main__':
    main()
