from matplotlib.image import imread
import matplotlib.pyplot as plt
import numpy as np
linziList = ["互", "文", "即", "雪", "夏", "冬", "止", "端", "春", "秋", "混", "祭", "極", "労", "助", "定", "軟", "豊", "貧", "倒",
             "長", "傾", "圧", "鼓", "包", "散", "深", "門", "傷", "棚", "寝", "綿", "少", "黒", "反", "血", "謝", "豆", "父", "琴",
             "煙", "耳", "抗", "母", "酒", "十", "道", "奮", "素", "祖", "前", "従", "茶", "正", "樽", "甘", "歌", "裁", "片", "件",
             "震", "青", "嗅", "後", "歪", "近", "広", "挽", "平", "欽", "夘", "布", "械", "函", "輝", "累", "岩", "禦", "立", "疲",
             "座", "通", "哩", "麗", "耒", "貓", "能", "柔", "恒", "聯", "短", "直", "棉", "箏", "店", "㕮", "吁", "鎖", "多", "救",
             "皷", "从", "后", "笛", "筒", "増", "笙", "竹", "竺", "属", "針", "翰", "寐", "享", "軍", "隊", "氏", "閥", "纂", "穐",
             "啌", "哇", "浬", "刻", "羅", "聚", "叛", "科", "吏", "宦", "僚", "健", "兄"]


def main():
	A = imread('Linzi_dot_part2.png')
	C = imread('Linzi_dot_part2_nonborder.png')
	for i in range(len(linziList)):
		save(A,C,int(i/20),i%20,linziList[i]);


# ith row, jth column
def save(A,C, i,j,name):
	B = A[i*16:(i+1)*16,j*16:(j+1)*16]
	D = C[i*16:(i+1)*16,j*16:(j+1)*16]
	plt.imsave('燐字画像14/'+name + '.png', B)
	plt.imsave('燐字画像15/'+name + '.png', D)

if __name__ == '__main__':
    main()
