from matplotlib.image import imread
import matplotlib.pyplot as plt
import numpy as np
linziList = ["我","汝","此","其","彼","何","或","全","無","在","","己","物","人","如","之","処","時","故","位",
	"術","言","字","筆","書","墨","","論","紙","絵","手","足","心","目","口","骨","頭","腹","背","肉",
	"光","闇","木","草","火","水","風","石","金","膠","花","種","果","油","脂","大","中","小","周","内",
	"外","軸","衣","糸","日","月","星","天","地","山","谷","川","海","陸","島","上","下","左","右","東",
	"西","南","北","縦","横","高","低","始","終","出","入","一","二","三","四","五","六","七","八","九",
	"撃","行","来","識","獣","鳥","魚","虫","龍","機","箱","","男","女","皇","神","船","兵","弓","車",
	"虎","馬","巫","将","王","類","為","貝","刀","声","家","善","友","美","受","与","力","","而","",
	"御","再","乎","於","","悪","真","噫","","","","","","","","律","集","亦","値","積",
	"国","同","閉","開","","","","","倉","官","","","意","連","","","笑","戦","壊","等",
	"","","静","層","","色","季","銭","名","","","冠","満","族","清","","錘","","菓","硬",
	"牌","","","","","","","","","","机","","席","","","認","","","","",
	"","","輩","","","","輪","","","覆","","","","","","","","古","","",
	"","","米","勿","猫","","学","守","","囲","","","","","新","蜜","","","使","",
	"唯","","","","","","味","","","","","","","","党","","","","加","別"]


def main():
	A = imread('Linzi_dot.png')
	C = imread('Linzi_dot_nonborder.png')
	for i in range(len(linziList)):
		save(A,C,int(i/20),i%20,linziList[i]);


# ith row, jth column
def save(A,C, i,j,name):
	B = A[i*16:(i+1)*16,j*16:(j+1)*16]
	D = C[i*16:(i+1)*16,j*16:(j+1)*16]
	plt.imsave('燐字画像2/'+name + '.png', B)
	plt.imsave('燐字画像3/'+name + '.png', D)

if __name__ == '__main__':
    main()
