from matplotlib.image import imread
import matplotlib.pyplot as plt
import numpy as np
linziList1 = [
	"","","","","","","","端","","","混","","","","祭","","","","労","助","","貧","","長","傾","鼓","散","深","","黒","","","","豆","父","","","抗","母","","酒","奮","","素","祖","前","","従","茶","正","樽","","甘","","","","裁","","","片","件","震","","嗅","後","歪","広","","挽","","","","立","疲","","","座","","","","","","","能","","","","","","","短","直","","","","","","","","","㕮","吁","救","皷","从","","","","","","","","","","","","","",""]


t1 = [[ 4.50000000e+02,  2.36736842e+02, -1.13950516e-13],
 [ 8.63500000e+02, -2.63157895e-01,  3.37400000e+02]];


def main():
	foo('img1.png',linziList1,t1)

def foo(path,list_,t):
	A = imread(path)
	for i in range(len(list_)):
		save(t,A,int(i/20),i%20,list_[i]);


# ith row, jth column
def save(t,A,i,j,name):
	if name == "":
		return
	I = int(t[0][0] + t[0][1]*j + t[0][2]*i)
	J = int(t[1][0] + t[1][1]*j + t[1][2]*i)
	B = A[J:J+235,I:I+240]
	plt.imsave('../燐字画像7/'+name + '.png', B)
	print(name)

if __name__ == '__main__':
    main()
