var linzi1 = new Image();
linzi1.src = "linzi1.png";
var linzi2 = new Image();
linzi2.src = "linzi2.png";

var linziList = ["我","汝","此","其","彼","何","或","全","無","在","","己","物","人","如","之","処","時","故","位",
"術","言","字","筆","書","墨","","論","紙","絵","手","足","心","目","口","骨","頭","腹","背","肉",
"光","闇","木","草","火","水","風","石","金","膠","花","種","果","油","脂","大","中","小","周","内",
"外","軸","衣","糸","日","月","星","天","地","山","谷","川","海","陸","島","上","下","左","右","東",
"西","南","北","縦","横","高","低","始","終","出","入","一","二","三","四","五","六","七","八","九",
"撃","行","来","識","獣","鳥","魚","虫","龍","機","箱","","男","女","皇","神","船","兵","弓","車",
"虎","馬","巫","将","王","類","為","貝","刀","声","家","善","友","美","受","与","力","","而","",
"御","再","乎","於","","悪","真","噫","","","","","","","","律","集","亦","値","積",
"国","同","閉","開","","","","","倉","官","","","意","連","","","笑","戦","壊","等",
"","","静","層","","色","季","銭","名","","","冠","満","族","清","","錘","","菓","硬",
"牌","","","","","","","","","","机","","席","","","認","","","","",
"","","輩","","","","輪","","","覆","","","","","","","","古","","",
"","","米","勿","猫","","学","守","","囲","","","","","新","蜜","","","使","",
"唯","","","","","","味","","","","","","","","党","","","","加","別"]


function drawLinzis(txt,proportion, bordered)
{
  var size = (bordered ? 238 : 227)*proportion

  var canvas = document.getElementById('c3');
  var ctx = canvas.getContext('2d');

  canvas.width = size*txt.length;
  canvas.height = size;

  ctx.clearRect(0, 0, canvas.width, canvas.height);

  for(var i=0; i<txt.length; i++){
    var u = linziList.indexOf(txt.charAt(i));
    if(u == -1) continue;
    draw('c3', u%20, Math.floor(u/20), proportion, size*i, 0, bordered);
  }
}

function draw(id, s1, s2, proportion, offsetx, offsety, bordered) {
  proportion = proportion || 1;
  offsetx = offsetx || 0;
  offsety = offsety || 0;
  var canvas = document.getElementById(id);
  if ( ! canvas || ! canvas.getContext ) { return false; }
  var ctx = canvas.getContext('2d');

  var t;

  if(s2 < 10){
    //我:  159,  245 --->  0,0
    //位: 4658,  254 ---> 19,0
    //硬: 4645, 3290 ---> 19,9
    //形:  150, 3281 --->  0,9
    t = [[ 160.        ,  236.68421053,   -1.22222222],
         [ 245.        ,    0.47368421,  337.33333333]];
    linzi = linzi1;
  } else{
    //牌:  158,  210 --->  0,10
    //唯:  155, 1222 --->  0,13
    //別: 4654, 1220 ---> 19,13
    //綿: 4655,  208 ---> 19,10
    t = [[  1.64166667e+02,   2.36736842e+02,  -6.66666667e-01],
         [ -3.16333333e+03,  -1.05263158e-01,   3.37333333e+02]];
    linzi = linzi2;
  }

  var w = bordered ? 240 : 227;
  var h = bordered ? 240 : 227;

  ctx.drawImage(linzi, 
    t[0][0] + t[0][1]*s1 + t[0][2]*s2 + (bordered ? 0 : 5),
    t[1][0] + t[1][1]*s1 + t[1][2]*s2 + (bordered ? 0 : 5),
    w, h, offsetx, offsety, w*proportion, h*proportion);




}
